Revit 2027 API
ElementPhaseStatusFilter(ElementId, ElementOnPhaseStatus) Constructor
 Constructs a new instance of a file to match elements that have a given phase status on the input phase.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementPhaseStatusFilter(
	ElementId phaseId,
	ElementOnPhaseStatus phaseStatus
)
Public Sub New (
	phaseId As ElementId,
	phaseStatus As ElementOnPhaseStatus
)
public:
ElementPhaseStatusFilter(
	ElementId^ phaseId,
	ElementOnPhaseStatus phaseStatus
)
new :
        phaseId : ElementId *
        phaseStatus : ElementOnPhaseStatus -> ElementPhaseStatusFilter
Parameters
phaseId ElementId
 Id of the phase.
phaseStatus ElementOnPhaseStatus
 Target status.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ElementPhaseStatusFilter Class
ElementPhaseStatusFilter Overload
Autodesk.Revit.DB Namespace